{
    "default": {
        "title": "Welcome to your new Plesk Business Server",
        "description": "Hello %%username%%,\n\ngreat to meet you! My name is Elvis Plesky, I will assist you in the beginning of your journey with Plesk.\n\nYou made the right decision with the Business Server if you want to a pre-configured All-In-One solution for your projects!\n\nLet me help you to get started. Don't worry, it's easy with Plesk - and my help!",
        "image": "/modules/welcome/images/plesk_octopus_generic.png",
        "groups": [
            {
                "title": "Welcome",
                "steps": [
                    {
                        "title": "Create a WordPress website",
                        "description": "With the WordPress Toolkit you create your WordPress website easily within minutes. The toolkit allows enabling a variety of development workflows for WordPress admins and developers of all skill levels, from beginners to pros. Install or import your first WordPress website now!",
                        "image": "/modules/welcome/images/presets/wptk-icon.png",
                        "buttons": [
                            {
                                "actionId": "install-wordpress"
                            }
                        ]
                    },
                    {
                        "title": "Create mailboxes and folders with Plesk Premium Email",
                        "description": "Let's activate advanced email and collaboration services with Plesk Premium Email.\n\nPlesk Premium Email is powered by Kolab, the most popular fully-featured Open Source secure mail and collaboration server. It provides all the features associated with top tier collaboration servers, such as email, calendar, contacts, tasks, notes and files.",
                        "image": "/modules/welcome/images/presets/kolab-icon.png",
                        "buttons": [
                            {
                                "actionId": "open-kolab"
                            }
                        ]
                    },
                    {
                        "title": "Add an SSL certificate and secure your website",
                        "description": "Create an SSL certificate with the help of the Security Advisor.",
                        "image": "/modules/welcome/images/presets/security-advisor-icon.png",
                        "buttons": [
                            {
                                "actionId": "open-advisor"
                            }
                        ]
                    },
                    {
                        "title": "Optimize your website with Google PageSpeed Insights",
                        "description": "Check your business website with Google PageSpeed Insights and boost your website performance with Google PageSpeed for Apache.",
                        "image": "/modules/welcome/images/presets/pagespeed-insights-icon.png",
                        "buttons": [
                            {
                                "actionId": "open-pagespeed"
                            }
                        ]
                    },
                    {
                        "title": "Maximize your search engine traffic with SEO Toolkit",
                        "description": "Let the SEO Toolkit guide you towards maximizing your search engine traffic.",
                        "image": "",
                        "buttons": [
                            {
                                "actionId": "open-xovi"
                            }
                        ]
                    }
                ]
            }
        ],
        "actions": {
            "install-wordpress": {
                "taskId": "install",
                "extensionId": "wp-toolkit"
            },
            "open-kolab": {
                "taskId": "extlink",
                "extensionId": "kolab"
            },
            "open-advisor": {
                "taskId": "extlink",
                "extensionId": "advisor"
            },
            "open-pagespeed": {
                "taskId": "extlink",
                "extensionId": "pagespeed-insights"
            },
            "open-xovi": {
                "taskId": "extlink",
                "extensionId": "xovi"
            }
        }
    }
}
